<?php
return [
    'ms_act_list' => [
        '576cef3d6dfba' => [
            'start_time' => 1466757713,
            'end_time' => 1566757713,
            'goods' => [
                '576cf05c9fbe8' => [
                        'name' => '蚕丝被',
                        'desc' => '原价9999，现价999元。吐血大甩卖。赶紧抢了，数量有限，先到先得。',
                        'num' => 100
                ],
                '576cf070179d0' => [
                        'name' => '太空船',
                        'desc' => '原价999999，现价99999元。前所未有的低价，你懂的。',
                        'num' => 3
                ],
                '576cf070279d1' => [
                        'name' => '航空母舰',
                        'desc' => '原价9999999，现价999999元。前所未有的低价，你懂的。',
                        'num' => 10
                ]
            ]
        ]
    ]
];
