frontend/modules/activity/controllers/CouponController.php

SELECT `hygl_coupon`.* FROM `hygl_coupon` LEFT JOIN `hygl_coupon_log` ON `hygl_coupon`.`coupon_id` = `hygl_coupon_log`.`coupon_id` WHERE `hygl_coupon`.`status`=1 ORDER BY `hygl_coupon`.`insert_time` DESC LIMIT 20
---
    public function actionIndex()
    {
        //判断是否在微信内
        if (!$this->_isWechat())
        {
            $this->error(-1, '请在微信内访问本链接');
        }



        //获取优惠券
        $app = Coupon::find('hygl_coupon.*,hygl_coupon_log.status hygl_coupon_log_status')->joinWith('couponLog')->where(['hygl_coupon.status' => 1])->orderBy('hygl_coupon.insert_time desc')->asArray()->limit(20)->all();

SELECT * FROM `hygl_coupon` WHERE `coupon_guid`='2DD4E441-DFF2-ED4D-5646-080D93868B1C'
---
    public function actionReceiveCoupon()
    {
        //判断是否有传参
        $coupon_guid = Yii::$app->request->post('data');

        $coupon_guid = $coupon_guid['coupon_guid'];

        if (!$coupon_guid)
        {
            $this->error(-1, '优惠券不存在3');
        }

        //获取优惠券
        $app = Coupon::find()->where(['coupon_guid' => $coupon_guid])->asArray()->one();

SELECT COUNT(*) FROM `hygl_coupon_log` WHERE (`open_id`='okFt4t3lWd5WOzjdKqkKaLm2wkxE') AND (`coupon_id`='9')
---
        $userInfo = Yii::$app->wechat->user;

        //判断用户是否已报名
        $info = CouponLog::find()->where(['open_id' => $userInfo->id, 'coupon_id' => $app['coupon_id']])->count();

SELECT * FROM `users` WHERE `open_id`='okFt4t3lWd5WOzjdKqkKaLm2wkxE'
---
            $this->error(-1, '你已经获取过了');
        }

        $myuser = Users::find()->where(['open_id' => $userInfo->id])->one();

INSERT INTO `hygl_coupon_log` (`coupon_id`, `ip`, `insert_time`, `userid`, `open_id`, `nickname`, `operat_time`) VALUES ('9', '10.0.7.91', 1498114012, 17, 'okFt4t3lWd5WOzjdKqkKaLm2wkxE', '疆韬', 0)
---


        $model = new CouponLog();
        $model->load($post, '') && $model->save();

SELECT * FROM `hygl_coupon`
SELECT * FROM `hygl_coupon_log` WHERE `open_id`='okFt4t3lWd5WOzjdKqkKaLm2wkxE' ORDER BY `id` DESC
UPDATE `hygl_coupon_log` SET `share_time`=1498114028 WHERE `id` IN (44, 17, 'okFt4t3lWd5WOzjdKqkKaLm2wkxE', '疆韬', '10.0.7.91', NULL, '9', 1498114012, 0, NULL, 0, NULL)
SELECT * FROM `lottery_list` WHERE ((`status` <= 1) AND (`start_time` < 1498114028)) AND (`end_time` > 1498114028) ORDER BY `id` DESC
---
    public function actionShare()
    {
        try
        {
            $app = Coupon::find()->asArray()->one();
            $this->oauthCheck([
                'app_alias_name' => $app['mp_type'] ?: 'yezilvxing',
                'ajax' => true,
                'db' => true,
                'silence' => false
            ]);
            $userInfo = Yii::$app->wechat->user;
            $userid = $userInfo->id;

            $maxid = CouponLog::find('id')->andWhere(["open_id" => $userid])->orderBy('id desc')->one();

            $log = CouponLog::updateAll(["share_time" => time()], ["id" => $maxid]);
            $lottery = LotteryList::find('group_id')->andWhere(['<=', 'status', 1])->andWhere(['<', 'start_time' , time()])->andWhere(['>' , 'end_time' , time()])->orderBy('id desc')->one();

SELECT * FROM `hygl_coupon`
---
    public function actionMy()
    {
        $app = Coupon::find()->asArray()->one();

SELECT * FROM `users` WHERE `open_id`='okFt4t3lWd5WOzjdKqkKaLm2wkxE'
SELECT `hygl_coupon_log`.*, `hygl_coupon`.`title`, `hygl_coupon`.`price`, `hygl_coupon`.`depict` FROM `hygl_coupon_log` LEFT JOIN `hygl_coupon` ON `hygl_coupon_log`.`coupon_id` = `hygl_coupon`.`coupon_id` WHERE `hygl_coupon_log`.`userid`=17 ORDER BY `hygl_coupon_log`.`id` DESC
---
    public function actionMyCoupon()
    {
        $userInfo = Yii::$app->wechat->user;
        $myuser = Users::find()->where(['open_id' => $userInfo->id])->one();
        $userid = $myuser->uid;
        //获取优惠券
        $app = CouponLog::find()->select('hygl_coupon_log.*,hygl_coupon.title,hygl_coupon.price,hygl_coupon.depict')->joinWith(['coupon'])->andWhere(['hygl_coupon_log.userid' => $userid])->orderBy('hygl_coupon_log.id desc')->asArray()->all();

SELECT * FROM `hygl_coupon`
SELECT `lottery_winner`.*, `lottery_prize`.*, `lottery_list`.`act_name` FROM `lottery_winner` LEFT JOIN `lottery_list` ON `lottery_winner`.`act_id` = `lottery_list`.`id` LEFT JOIN `lottery_prize` ON `lottery_winner`.`prize_id` = `lottery_prize`.`id` WHERE `lottery_winner`.`open_id`='okFt4t3lWd5WOzjdKqkKaLm2wkxE' ORDER BY `lottery_winner`.`id` DESC
---
    public function actionMyPrize()
    {
        $app = Coupon::find()->asArray()->one();
        //微信授权
        $this->oauthCheck([
            'app_alias_name' => $app['mp_type'] ?: 'yezilvxing',
            'ajax' => true,
            'db' => true,
            'silence' => false
        ]);


        $userInfo = Yii::$app->wechat->user;
        $userid = $userInfo->id;
        //获取抽奖
        $app = LotteryWinner::find()->select('lottery_winner.*, lottery_prize.*,  lottery_list.act_name')->joinWith(['lottery'])->joinWith(['prizeitem'])->andWhere(['lottery_winner.open_id' => $userid])->orderBy('lottery_winner.id desc')->asArray()->all();