backend/modules/wxservice/views/draw/index.php

SELECT `title` FROM `lottery_active_group` WHERE `group_id`='2DC59B30-2460-0B3C-030A-89EC6EDD74D0'
---
                'value' => function($data){return $data['id'];},
                'headerOptions' => ['style' => 'text-align: left; width:60px;'],
            ],
            [
                    'attribute'=>'group_id',
                    'label' => '分组',
                    'value' => function ($data) {
                        if (!$data->group_id) return '-';
                        return $data->group->title;
                    },
                    'filter' => \common\models\wxservice\LotteryActiveGroup::groupList(),
                    'contentOptions' => ['style' => 'width: 20px;'],
                    'filterOptions' => ['style' => 'width: 20px;'],
            ],