common/models/activity/LotteryActiveGroup.php

    public static function groupList()
    {
        $list = self::find()->asArray()->all();
---
SELECT * FROM `lottery_active_group`