backend/modules/wxservice/controllers/CouponController.php

    public function actionCreate()
    {
        $model = new Coupon();
        if ($model->load(Yii::$app->request->post()))
        {
            $model->coupon_guid = CommonUtility::createGuid();
            if ($model->save())
---
INSERT INTO `hygl_coupon` (`title`, `price`, `mp_type`, `status`, `depict`, `coupon_guid`, `insert_id`, `insert_time`, `modify_time`) VALUES ('上海旅行优惠券', 666, 'xxcb', 1, '上海旅行优惠券上海旅行优惠券上海旅行优惠券', '2DD4E441-DFF2-ED4D-5646-080D93868B1C', 52, 1498113853, 0)

    public function actionUpdate($coupon_id)
    {
        $model = Coupon::findOne($coupon_id);
---
SELECT * FROM `hygl_coupon` WHERE `coupon_id`='7'

    public function actionReceive($id)
    {
        $model = CouponLog::findOne($id);
        if ($model->load(Yii::$app->request->post()))
        {
//            var_dump($model);die;
            $model->operat_time = time();
            $model->operator_id = Yii::$app->user->identity->id;

            if ($model->save())
---
SELECT * FROM `hygl_coupon_log` WHERE `id`='44'
UPDATE `hygl_coupon_log` SET `status`=1, `operator_id`=52, `operat_time`=1498114058, `depict`='556765' WHERE `id`=44