common/models/wxservice/WxApps.php

    public static function appList()
    {
        $list = self::find()->where(['disabled' => 0])->asArray()->all();
---
SELECT * FROM `wx_apps` WHERE `disabled`=0