frontend/base/BaseFrontController.php

    protected function oauthCheck($option = [])
    {
        //来源微信公众号
        $app = !isset($option['app_alias_name']) ? 'uv' : $option['app_alias_name'];
        Yii::$app->session->set('wxs_wechatApp', $app);

        //是否静默授权
        if (isset($option['silence']) && $option['silence'])
        {
            Yii::$app->session->set('wxs_wechatSilence_' . $app, true);
        }

        $wechat = Yii::$app->wechat;
        if($wechat->isWechat && !$wechat->isAuthorized())
        {
            if ($option['ajax']) $this->error(-2, '请先授权');
            else return $wechat->authorizeRequired()->send();
        }

        //静默授权不需要操作数据库
        if ((!isset($option['silence']) || !$option['silence']) && isset($option['db']) && $option['db'] && $wechat->isAuthorized())
        {
            $userInfo = $wechat->user;

            //保存用户
            if (!Users::find()->where(['open_id' => $userInfo->id])->count() && $userInfo->nickname)
---
SELECT COUNT(*) FROM `users` WHERE `open_id`='okFt4t3lWd5WOzjdKqkKaLm2wkxE'